app/controllers/patient/blood_glucose_level_controller.rb

SELECT `blood_glucose_levels`.* FROM `blood_glucose_levels` WHERE `blood_glucose_levels`.`patient_id` = 5 ORDER BY checked_at DESC
---
		def index
			@records = []
			patient_id = current_patient.blank? ? params[:patient_id] : current_patient.id
			@records = BloodGlucoseLevel.get_patient_record_monthwise(patient_id) unless patient_id.blank?

INSERT INTO `blood_glucose_levels` (`level`, `patient_id`, `created_at`, `updated_at`, `checked_at`) VALUES (200, 5, '2019-10-01 13:25:30', '2019-10-01 13:25:30', '2019-09-04 08:25:00')
---
		def create
			unless current_patient.blank?
				glucose_level = params[:blood_glucose][:level]
				date = params[:blood_glucose]["checked_at(1i)"] + "/" + params[:blood_glucose]["checked_at(2i)"]+ "/" + params[:blood_glucose]["checked_at(3i)"]+ " " + params[:blood_glucose]["checked_at(4i)"] + ":" + params[:blood_glucose]["checked_at(5i)"]
				new_record = BloodGlucoseLevel.new
				new_record[:patient_id] = current_patient.id
				new_record[:level] = glucose_level
				new_record[:checked_at] = date

				if new_record.save

UPDATE `blood_glucose_levels` SET `checked_at` = '2019-06-01 13:27:00', `updated_at` = '2019-10-01 13:27:47' WHERE `blood_glucose_levels`.`id` = 9
---
		def update
			id = params[:id]
			date = params[:blood_glucose]["checked_at(1i)"] + "/" + params[:blood_glucose]["checked_at(2i)"]+ "/" + params[:blood_glucose]["checked_at(3i)"]+ " " + params[:blood_glucose]["checked_at(4i)"] + ":" + params[:blood_glucose]["checked_at(5i)"]
			p "Checked at", date.to_datetime
			blood_glucose_level = params[:blood_glucose][:level].to_i
			blood_glucose_reading = BloodGlucoseLevel.get_a_record(id)
			unless blood_glucose_reading.blank? || blood_glucose_level.blank?
				blood_glucose_reading[:level] = blood_glucose_level
				blood_glucose_reading[:checked_at] = date
				if blood_glucose_reading.save