app/models/blood_glucose_level.rb

	scope :get_patient_record_monthwise, -> (record_id) { where(patient_id: record_id).order('checked_at DESC').group_by{ |record| record.checked_at.month } }
	scope :get_patient_record_daywise, -> (record_id) { where(patient_id: record_id).group_by{ |record| record.updated_at.beginning_of_day } }
---
SELECT `blood_glucose_levels`.* FROM `blood_glucose_levels` WHERE `blood_glucose_levels`.`patient_id` = 5 ORDER BY checked_at DESC
SELECT `blood_glucose_levels`.* FROM `blood_glucose_levels` WHERE `blood_glucose_levels`.`patient_id` = 5

	def check_record_limit_per_day
		unless self.patient_id.blank?
			records = BloodGlucoseLevel.patients_record_per_day(self.patient_id, Date.today)
			p "record_count", records.count
			if records.count >= 4
---
SELECT COUNT(*) FROM `blood_glucose_levels` WHERE `blood_glucose_levels`.`patient_id` = 3 AND `blood_glucose_levels`.`created_at` BETWEEN '2019-09-28 00:00:00' AND '2019-09-28 23:59:59'
SELECT COUNT(*) FROM `blood_glucose_levels` WHERE `blood_glucose_levels`.`patient_id` = 5 AND `blood_glucose_levels`.`created_at` BETWEEN '2019-10-01 00:00:00' AND '2019-10-01 23:59:59'